Revit 2024 API
RebarContainer.GetHostId Method
 The element that contains the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ElementId GetHostId()
Visual Basic
Public Function GetHostId As ElementId
Visual C++
public:
ElementId^ GetHostId()
Return Value
 The element that the rebar object belongs to, such as a structural wall, floor, foundation, beam, brace or column.
See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace